; domain
(define (domain p2)
(:requirements :strips :typing :action-costs)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:functions
    (total-cost)
    (fly-cost ?location_from - location ?location_to - location)    
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))  
        (increase (total-cost) 1)   
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)
        (increase (total-cost) (fly-cost ?location_from ?location_to))        
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
        (increase (total-cost) 1)  
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l9_p9_c9_g9_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(person-at person1 loc3)
	(person-at person2 loc2)
	(person-at person3 loc4)
	(person-at person4 loc3)
	(person-at person5 loc4)
	(person-at person6 loc9)
	(person-at person7 loc6)
	(person-at person8 loc7)
	(person-at person9 loc1)
(= (total-cost) 0)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 133)
	(= (fly-cost depot loc2) 107)
	(= (fly-cost depot loc3) 222)
	(= (fly-cost depot loc4) 122)
	(= (fly-cost depot loc5) 163)
	(= (fly-cost depot loc6) 209)
	(= (fly-cost depot loc7) 181)
	(= (fly-cost depot loc8) 97)
	(= (fly-cost depot loc9) 128)
	(= (fly-cost loc1 depot) 133)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 27)
	(= (fly-cost loc1 loc3) 106)
	(= (fly-cost loc1 loc4) 28)
	(= (fly-cost loc1 loc5) 93)
	(= (fly-cost loc1 loc6) 143)
	(= (fly-cost loc1 loc7) 87)
	(= (fly-cost loc1 loc8) 43)
	(= (fly-cost loc1 loc9) 54)
	(= (fly-cost loc2 depot) 107)
	(= (fly-cost loc2 loc1) 27)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 125)
	(= (fly-cost loc2 loc4) 31)
	(= (fly-cost loc2 loc5) 94)
	(= (fly-cost loc2 loc6) 146)
	(= (fly-cost loc2 loc7) 96)
	(= (fly-cost loc2 loc8) 19)
	(= (fly-cost loc2 loc9) 50)
	(= (fly-cost loc3 depot) 222)
	(= (fly-cost loc3 loc1) 106)
	(= (fly-cost loc3 loc2) 125)
	(= (fly-cost loc3 loc3) 1)
	(= (fly-cost loc3 loc4) 133)
	(= (fly-cost loc3 loc5) 78)
	(= (fly-cost loc3 loc6) 88)
	(= (fly-cost loc3 loc7) 50)
	(= (fly-cost loc3 loc8) 128)
	(= (fly-cost loc3 loc9) 95)
	(= (fly-cost loc4 depot) 122)
	(= (fly-cost loc4 loc1) 28)
	(= (fly-cost loc4 loc2) 31)
	(= (fly-cost loc4 loc3) 133)
	(= (fly-cost loc4 loc4) 1)
	(= (fly-cost loc4 loc5) 118)
	(= (fly-cost loc4 loc6) 168)
	(= (fly-cost loc4 loc7) 114)
	(= (fly-cost loc4 loc8) 49)
	(= (fly-cost loc4 loc9) 76)
	(= (fly-cost loc5 depot) 163)
	(= (fly-cost loc5 loc1) 93)
	(= (fly-cost loc5 loc2) 94)
	(= (fly-cost loc5 loc3) 78)
	(= (fly-cost loc5 loc4) 118)
	(= (fly-cost loc5 loc5) 1)
	(= (fly-cost loc5 loc6) 53)
	(= (fly-cost loc5 loc7) 30)
	(= (fly-cost loc5 loc8) 85)
	(= (fly-cost loc5 loc9) 45)
	(= (fly-cost loc6 depot) 209)
	(= (fly-cost loc6 loc1) 143)
	(= (fly-cost loc6 loc2) 146)
	(= (fly-cost loc6 loc3) 88)
	(= (fly-cost loc6 loc4) 168)
	(= (fly-cost loc6 loc5) 53)
	(= (fly-cost loc6 loc6) 1)
	(= (fly-cost loc6 loc7) 60)
	(= (fly-cost loc6 loc8) 137)
	(= (fly-cost loc6 loc9) 97)
	(= (fly-cost loc7 depot) 181)
	(= (fly-cost loc7 loc1) 87)
	(= (fly-cost loc7 loc2) 96)
	(= (fly-cost loc7 loc3) 50)
	(= (fly-cost loc7 loc4) 114)
	(= (fly-cost loc7 loc5) 30)
	(= (fly-cost loc7 loc6) 60)
	(= (fly-cost loc7 loc7) 1)
	(= (fly-cost loc7 loc8) 93)
	(= (fly-cost loc7 loc9) 54)
	(= (fly-cost loc8 depot) 97)
	(= (fly-cost loc8 loc1) 43)
	(= (fly-cost loc8 loc2) 19)
	(= (fly-cost loc8 loc3) 128)
	(= (fly-cost loc8 loc4) 49)
	(= (fly-cost loc8 loc5) 85)
	(= (fly-cost loc8 loc6) 137)
	(= (fly-cost loc8 loc7) 93)
	(= (fly-cost loc8 loc8) 1)
	(= (fly-cost loc8 loc9) 41)
	(= (fly-cost loc9 depot) 128)
	(= (fly-cost loc9 loc1) 54)
	(= (fly-cost loc9 loc2) 50)
	(= (fly-cost loc9 loc3) 95)
	(= (fly-cost loc9 loc4) 76)
	(= (fly-cost loc9 loc5) 45)
	(= (fly-cost loc9 loc6) 97)
	(= (fly-cost loc9 loc7) 54)
	(= (fly-cost loc9 loc8) 41)
	(= (fly-cost loc9 loc9) 1)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person4 food)
	(has-content-person person4 medicine)
	(has-content-person person5 food)
	(has-content-person person6 medicine)
	(has-content-person person8 food)
	(has-content-person person8 medicine)
))
(:metric minimize (total-cost))
)

; plan
1. (put-crate-in-carrier crate5 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space1)
   goals met: 1 of 10
2. (put-crate-in-carrier crate9 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space2)
   goals met: 1 of 10
3. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 0 of 10
4. (pick-and-drop crate5 loc2 drone1 carrier1 space1 person2 food)
   deleted: (crate-at-space crate5 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person2 food)
   goals met: 1 of 10
5. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 10
6. (put-crate-in-carrier crate4 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space1)
   goals met: 2 of 10
7. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 1 of 10
8. (pick-and-drop crate4 loc4 drone1 carrier1 space1 person5 food)
   deleted: (crate-at-space crate4 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person5 food)
   goals met: 2 of 10
9. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 10
10. (put-crate-in-carrier crate3 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space1)
   goals met: 3 of 10
11. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 2 of 10
12. (pick-and-drop crate9 loc9 drone1 carrier1 space2 person6 medicine)
   deleted: (crate-at-space crate9 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person6 medicine)
   goals met: 3 of 10
13. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 10
14. (put-crate-in-carrier crate8 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space2)
   goals met: 4 of 10
15. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 3 of 10
16. (pick-and-drop crate3 loc3 drone1 carrier1 space1 person1 food)
   deleted: (crate-at-space crate3 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person1 food)
   goals met: 4 of 10
17. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 10
18. (put-crate-in-carrier crate2 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space1)
   goals met: 5 of 10
19. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 4 of 10
20. (pick-and-drop crate8 loc3 drone1 carrier1 space2 person1 medicine)
   deleted: (crate-at-space crate8 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person1 medicine)
   goals met: 5 of 10
21. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 10
22. (put-crate-in-carrier crate7 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space2)
   goals met: 6 of 10
23. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 5 of 10
24. (pick-and-drop crate2 loc3 drone1 carrier1 space1 person4 food)
   deleted: (crate-at-space crate2 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person4 food)
   goals met: 6 of 10
25. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 10
26. (put-crate-in-carrier crate1 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space1)
   goals met: 7 of 10
27. (move-carrier depot loc7 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   goals met: 6 of 10
28. (pick-and-drop crate1 loc7 drone1 carrier1 space1 person8 food)
   deleted: (crate-at-space crate1 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person8 food)
   goals met: 7 of 10
29. (pick-and-drop crate7 loc7 drone1 carrier1 space2 person8 medicine)
   deleted: (crate-at-space crate7 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person8 medicine)
   goals met: 8 of 10
30. (move-carrier loc7 depot drone1 carrier1)
   deleted: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 10
31. (put-crate-in-carrier crate6 depot drone1 carrier1 space1)
   deleted: (empty-space carrier1 space1) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space1)
   goals met: 9 of 10
32. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 8 of 10
33. (pick-and-drop crate6 loc3 drone1 carrier1 space1 person4 medicine)
   deleted: (crate-at-space crate6 carrier1 space1)
   added: (empty-space carrier1 space1) (has-content-person person4 medicine)
   goals met: 9 of 10
34. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 10 of 10
